Revit 2027 API
ExportPatternInfo(String) Constructor
 Constructs a new ExportPatternInfo using the destination pattern name as input.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportPatternInfo(
	string destinationPatternName
)
Public Sub New (
	destinationPatternName As String
)
public:
ExportPatternInfo(
	String^ destinationPatternName
)
new :
        destinationPatternName : string -> ExportPatternInfo
Parameters
destinationPatternName String
 The destination pattern name (the name of the pattern in the exported format).
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportPatternInfo Class
ExportPatternInfo Overload
Autodesk.Revit.DB Namespace